package database

import (
	"database/sql"
	"fmt"
	"strings"
)

func SeedSchedule(db *sql.DB) error {
	// Проверяем, есть ли данные
	var count int
	err := db.QueryRow("SELECT COUNT(*) FROM schedule").Scan(&count)
	if err != nil {
		return fmt.Errorf("check schedule count: %w", err)
	}

	if count > 0 {
		fmt.Println("Расписание уже заполнено")
		return nil
	}

	// Если пусто — вставляем данные
	schedule := []struct {
		weekType  string
		dayOfWeek string
		subject   string
		cabinet   string
	}{

		// Числитель - Понедельник
		{"числитель", "понедельник", "Информационные технологии", "523"},
		{"числитель", "понедельник", "Основы алгоритмизации и программирования", "514"},
		{"числитель", "понедельник", "Элементы высшей математики", "512"},

		// Числитель - Вторник
		{"числитель", "вторник", "Техн. физ. уровня передачи данных", "523"},
		{"числитель", "вторник", "Физра", "зал"},
		{"числитель", "вторник", "Иностранный язык в проф деятельности", "307/309"},

		// Числитель - Среда
		{"числитель", "среда", "Основы алгоритмизации и программирования", "514"},
		{"числитель", "среда", "Информационные технологии", "523"},
		{"числитель", "среда", "Техн. физ. уровня передачи данных", "523"},

		// Числитель - Четверг
		{"числитель", "четверг", "История России", "622"},
		{"числитель", "четверг", "Архетиктура аппаратных средств", "330"},
		{"числитель", "четверг", "Операционные системы и среды", "503"},

		// Числитель - Пятница
		{"числитель", "пятница", "Архетиктура аппаратных средств", "330"},
		{"числитель", "пятница", "Арзетиктура аппаратных средств", "330"},
		{"числитель", "пятница", "Элементы высшей математики", "512"},

		// Числитель - Выходные
		{"числитель", "суббота", "выходной", ""},
		{"числитель", "воскресенье", "выходной", ""},

		// Знаменатель - Понедельник
		{"знаменатель", "понедельник", "Информационные технологии", "523"},
		{"знаменатель", "понедельник", "Основы алгоритмизации и программирования", "514"},
		{"знаменатель", "понедельник", "Архетиктура аппаратных средств", "330"},

		// Знаменатель - Вторник
		{"знаменатель", "вторник", "Техн. физ. уровня передачи данных", "523"},
		{"знаменатель", "вторник", "Физра", "зал"},
		{"знаменатель", "вторник", "Иностранный язык в проф деятельности", "307/309"},

		// Знаменатель - Среда
		{"знаменатель", "среда", "Основы алгоритмизации и программирования", "514"},
		{"знаменатель", "среда", "Операционные системы и среды", "503"},
		{"знаменатель", "среда", "Основы алгоритмизации и программирования", "514"},

		// Знаменатель - Четверг
		{"знаменатель", "четверг", "Информационные технологии", "523"},
		{"знаменатель", "четверг", "История России", "622"},
		{"знаменатель", "четверг", "Операционные системы и среды", "503"},

		// Знаменатель - Пятница
		{"знаменатель", "пятница", "Архетиктура аппаратных средств", "330"},
		{"знаменатель", "пятница", "История России", "622"},
		{"знаменатель", "пятница", "Элементы высшей математики", "512"},

		// Знаменатель - Выходные
		{"знаменатель", "суббота", "выходной", ""},
		{"знаменатель", "воскресенье", "выходной", ""},
	}

	for _, s := range schedule {
		_, err := db.Exec(
			"INSERT INTO schedule (week_type, day_of_week, subject,cabinet) VALUES ($1, $2, $3,$4)",
			s.weekType, s.dayOfWeek, s.subject, s.cabinet,
		)
		if err != nil {
			return fmt.Errorf("insert schedule: %w", err)
		}
	}

	fmt.Println("Расписание добавлено в таблицу")
	return nil
}

func GetSchedule(db *sql.DB, weekType, dayOfWeek string) (string, error) {
	rows, err := db.Query("SELECT subject, cabinet FROM schedule WHERE week_type=$1 AND day_of_week=$2", weekType, dayOfWeek)
	if err != nil {
		return "", fmt.Errorf("query schedule: %w", err)
	}
	defer rows.Close()

	var result strings.Builder
	result.WriteString(fmt.Sprintf("📅 Расписание на %s (%s):\n\n", dayOfWeek, weekType))
	index := 1
	for rows.Next() {
		var subject string
		var cabinet sql.NullString

		if err := rows.Scan(&subject, &cabinet); err != nil {
			return "", fmt.Errorf("scan schedule: %w", err)
		}

		// Пропускаем выходные
		if subject == "выходной" {
			continue
		}

		// Форматируем вывод с кабинетами
		if cabinet.Valid && cabinet.String != "" {
			result.WriteString(fmt.Sprintf("%d. 📚 %s (🚪 %s)\n", index, subject, cabinet.String))
		} else {
			result.WriteString(fmt.Sprintf("%d. 📚 %s\n", index, subject))
		}
		index++
	}

	return result.String(), nil
}
func Subjects(subjects []string) string {
	var result strings.Builder
	for i, subject := range subjects {
		result.WriteString(fmt.Sprintf("%d. %s\n", i+1, subject))
	}
	return result.String()
}
